In [28]:
#!pip3 install mysql-connector-python

In [5]:
import mysql.connector
import pandas as pd

In [47]:


connection = mysql.connector.connect(
  host="b8rzawgklevuix0zi5mu-mysql.services.clever-cloud.com", # replace username, hostname, password and database name appropriately
  user="uof0m19h2v9tclea",
  password="1Qm5vnauBiqPLB4KtlZI",
  database="b8rzawgklevuix0zi5mu"
)

cursor1 = connection.cursor()

In [48]:
#cursor1.execute("CREATE TABLE Test_table (name VARCHAR(255), place VARCHAR(255))")

In [50]:
cursor1.execute("SHOW TABLES")

for x in cursor1:
    print(x)

('Test_table',)
('subject',)

In [51]:
#cursor1.execute("CREATE TABLE subject (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(255), teacher VARCHAR(255))")

In [52]:
#cursor1.execute("ALTER TABLE Test_table ADD COLUMN id INT AUTO_INCREMENT PRIMARY KEY")

In [53]:
cursor1.execute("ALTER TABLE Test_table  AUTO_INCREMENT=0")

#### INSERT TUPLES INTO THE DF

In [54]:
sql="INSERT INTO Test_table (name,place) VALUES (%s ,%s)"  #insert a single tuple
val=('Kiran','Pune')

cursor1.execute(sql,val)

In [55]:
connection.commit()
print(cursor1.rowcount,"tuple inserted")

1 tuple inserted

In [56]:
cursor1.execute()

TypeError: execute() missing 1 required positional argument: 'operation'

In [57]:
#cursor1 = connection.cursor()
sql="INSERT INTO Test_table(name,place) VALUES (%s,%s)"

val=[('christina','Cov'),
    ('Sharlene','Cov')]

cursor1.executemany(sql,val)

In [58]:
print(cursor1.rowcount,'tuple were inserted')

2 tuple were inserted

#### SELECT DATA FROM A TABLE

In [59]:
cursor1.execute("SELECT * FROM Test_table")

In [60]:
result1 =cursor1.fetchone()   #fetch the first tuple
print(result1)

('Kiran', 'Pune', 1)

In [61]:
result2=cursor1.fetchall()   #fetch all the tuple

for i in result2:
    print(i)

('christina', 'Cov', 2)
('Sharlene', 'Cov', 3)
('Kiran', 'Pune', 4)
('Kiran', 'Pune', 5)
('Kiran', 'Pune', 6)
('christina', 'Cov', 7)
('Sharlene', 'Cov', 8)

In [62]:
cursor1.execute("SELECT name FROM Test_table")

myresult3 =cursor1.fetchall()

for i in myresult3:
    print(i)

('Kiran',)
('christina',)
('Sharlene',)
('Kiran',)
('Kiran',)
('Kiran',)
('christina',)
('Sharlene',)

In [65]:
cursor1.execute("SELECT place FROM Test_table")

myresult4 =cursor1.fetchall()

for i in myresult4:
    print(i)

('Pune',)
('Cov',)
('Cov',)
('Pune',)
('Pune',)
('Pune',)
('Cov',)
('Cov',)

In [64]:
cursor1.execute("SELECT name ,place FROM Test_table")
myresult5 =cursor1.fetchall()

for i in myresult5:
    print(i)

('Kiran', 'Pune')
('christina', 'Cov')
('Sharlene', 'Cov')
('Kiran', 'Pune')
('Kiran', 'Pune')
('Kiran', 'Pune')
('christina', 'Cov')
('Sharlene', 'Cov')

#### Limit the Display

In [38]:
cursor1.execute( "SELECT * FROM Test_table LIMIT 2")  #show only two results

result2 =cursor1.fetchall()

for x in result2:
    print(x)

('Kiran', 'Pune', 1)
('christina', 'Cov', 2)

#### Filter Application

In [39]:
funct1="SELECT name ,place FROM Test_table WHERE name ='Kiran'"
cursor1.execute(funct1)
result_6 =cursor1.fetchall()

for i in result_6:
    print(i)

('Kiran', 'Pune')
('Kiran', 'Pune')
('Kiran', 'Pune')

In [40]:
print(result_6)

[('Kiran', 'Pune'), ('Kiran', 'Pune'), ('Kiran', 'Pune')]

#### Delete Tuples

In [13]:
funct2= "DELETE FROM Test_table WHERE name ='Kiran'"

cursor1.execute(funct2)

print(cursor1.rowcount, "are delected")

3 are delected

#### Fetch Data with Filter

In [21]:
funct4="SELECT count(*) FROM Test_table WHERE name ='Christina'"

cursor1.execute(funct4)

result4=cursor1.fetchall()

for i in result4:
    print(i)

(1,)

#### Table Updation

In [33]:
funct5="UPDATE Test_table SET name ='kc' WHERE name ='Kiran'"

cursor1.execute(funct5)

print(cursor1.rowcount, 'are affected')

3 are affected

In [34]:
#to check the table for changes
funt1="SELECT name ,place FROM Test_table "
cursor1.execute(funt1)
result_6 =cursor1.fetchall()

for i in result_6:
    print(i)

('kc', 'Pune')
('Christina C', 'Cov')
('Sharlene', 'Cov')
('kc', 'Pune')
('kc', 'Pune')

#### Count the data in the Table

In [17]:
filt3= "SELECT count(*) FROM Test_table"

cursor1.execute(filt3)

result3 =cursor1.fetchall()

for x in result3:
        print(x)

(2,)

#### CONVERT INTO PANDAS DF FOR ANALYSIS

In [66]:
print(result2)

[('christina', 'Cov', 2), ('Sharlene', 'Cov', 3), ('Kiran', 'Pune', 4), ('Kiran', 'Pune', 5), ('Kiran', 'Pune', 6), ('christina', 'Cov', 7), ('Sharlene', 'Cov', 8)]

In [74]:
col1=list(zip(result2))  #this is just to show the difference of list creation without the * in the command
col1

[(('christina', 'Cov', 2),),
 (('Sharlene', 'Cov', 3),),
 (('Kiran', 'Pune', 4),),
 (('Kiran', 'Pune', 5),),
 (('Kiran', 'Pune', 6),),
 (('christina', 'Cov', 7),),
 (('Sharlene', 'Cov', 8),)]

In [75]:
col2=list(zip(*result2))
col2

[('christina', 'Sharlene', 'Kiran', 'Kiran', 'Kiran', 'christina', 'Sharlene'),
 ('Cov', 'Cov', 'Pune', 'Pune', 'Pune', 'Cov', 'Cov'),
 (2, 3, 4, 5, 6, 7, 8)]

In [79]:
df=pd.DataFrame({'name':col2[0],'address':col2[1]})

In [80]:
df

        name address
0  christina     Cov
1   Sharlene     Cov
2      Kiran    Pune
3      Kiran    Pune
4      Kiran    Pune
5  christina     Cov
6   Sharlene     Cov

#### Table Delection

In [81]:
funct6= "DROP TABLE subject "
cursor1.execute(funct6)

In [82]:
#to display the table in db
cursor1.execute("SHOW TABLES") 

for x in cursor1:
    print(x)

('Test_table',)